Examples/other/capillaryRise/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 20 0)
    (0 20 0)
    (0 0 1)
    (1 0 1)
    (1 20 1)
    (0 20 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 400 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (1 5 4 0)
    )
    patch atmosphere
    (
        (3 7 6 2)
    )
    wall walls
    (
        (0 4 7 3)
        (2 6 5 1)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
